[
  {
    "id": "4361755818",
    "trackingId": "uxVQYofd9IIqW2Ro8oJREg==",
    "refId": "hoEvzJQzntQjIlxBn+RgFw==",
    "link": "https://www.linkedin.com/jobs/view/senior-software-engineer-at-coltech-4361755818?refId=hoEvzJQzntQjIlxBn%2BRgFw%3D%3D&trackingId=uxVQYofd9IIqW2Ro8oJREg%3D%3D&position=23&pageNum=0",
    "title": "Senior Software Engineer",
    "companyName": "Coltech",
    "companyLinkedinUrl": "https://uk.linkedin.com/company/coltechglobal?trk=public_jobs_jserp-result_job-search-card-subtitle",
    "companyLogo": "https://media.licdn.com/dms/image/v2/D4E0BAQFivlPos4UaOw/company-logo_100_100/company-logo_100_100/0/1666001564790/coltechglobal_logo?e=1772064000&v=beta&t=SUo3MY5avf2H9x3ZFnFIzBvaGFPB8EaNYtgJ31x8FP8",
    "location": "New York, NY",
    "salaryInfo": [
      ""
    ],
    "postedAt": "2026-02-08",
    "benefits": [
      "Actively Hiring"
    ],
    "descriptionHtml": "<p><strong>Senior Software Engineer (TypeScript/Node.js) (Hybrid – East Coast, US)</strong> - **NO 3RD PARTY RECRUITERS**</p><p><br></p><p>We’re looking for strong senior level Software Engineers (TypeScript,/Node.js) to join a growing team supporting a high-impact product.</p><p><br></p><p>What we’re looking for:</p><p><br></p><ul><li>Deep experience with TypeScript and Node.js</li><li>Excellent communication skills — you can explain ideas clearly to both technical and non-technical teammates</li><li>Comfortable working hybrid (2–3 days onsite per week) on the US East Coast</li><li>Authorized to work in the US (no sponsorship required)</li><li>Willing and able to be onsite as part of a collaborative team</li><li>Initial 12-month engagement with potential to extend</li><li>Competitive rates</li></ul><p><br></p><p>If you’re a hands-on engineer who enjoys working closely with others and building real-world solutions, we’d love to hear from you.</p><p><br></p><p><strong>*PLEASE NOTE, WE CAN NOT OFFER SPONSORSHIP FOR THIS ROLE AND WILL NOT WORK WITH 3RD PARTY RECRUITERS*</strong></p>",
    "applicantsCount": "70",
    "applyUrl": "",
    "salary": "",
    "descriptionText": "Senior Software Engineer (TypeScript/Node.js) (Hybrid – East Coast, US) - **NO 3RD PARTY RECRUITERS**We’re looking for strong senior level Software Engineers (TypeScript,/Node.js) to join a growing team supporting a high-impact product.What we’re looking for:Deep experience with TypeScript and Node.jsExcellent communication skills — you can explain ideas clearly to both technical and non-technical teammatesComfortable working hybrid (2–3 days onsite per week) on the US East CoastAuthorized to work in the US (no sponsorship required)Willing and able to be onsite as part of a collaborative teamInitial 12-month engagement with potential to extendCompetitive ratesIf you’re a hands-on engineer who enjoys working closely with others and building real-world solutions, we’d love to hear from you.*PLEASE NOTE, WE CAN NOT OFFER SPONSORSHIP FOR THIS ROLE AND WILL NOT WORK WITH 3RD PARTY RECRUITERS*",
    "seniorityLevel": "Mid-Senior level",
    "employmentType": "Contract",
    "jobFunction": "Information Technology",
    "industries": "IT Services and IT Consulting",
    "inputUrl": "https://www.linkedin.com/jobs/search/?keywords=software developer &location=new york &f_TPR=r86400",
    "companyAddress": {
      "type": "PostalAddress",
      "addressLocality": "London",
      "postalCode": "EC3N 2EX",
      "addressCountry": "GB"
    },
    "companyWebsite": "http://www.coltech.io",
    "companySlogan": "Providing exceptional solutions to equally exceptional companies by providing capability not people 🚀",
    "companyDescription": "Coltech | Cloud & Software Engineering Specialists\n\nColtech is a specialist solutions provider focused on delivering high-impact cloud and software engineering teams to businesses across Europe and the U.S. from our offices in London, Amsterdam, and Austin, Texas.\n\nOur Focus Areas:\n🚀 Cloud Engineering & DevOps – Expertise in GCP, Kubernetes, and Golang for scalable, cloud-native transformation.\n🔹 Software Engineering – High-performance backend teams supporting fintech, SaaS, and enterprise IT modernization.\n💡 Project-Based Solutions – Deploying agile squads to support digital transformation and cloud migration projects.\n\nOur Approach:\n\n⭐Vision\nTo become the go-to partner for delivering expert engineering teams that drive successful project outcomes.\n\n⭐Mission\nTo deliver high-quality, cost-effective engineering solutions by combining global talent with speed and agility.\n\n⭐Purpose\nTo empower businesses with exceptional talent while creating meaningful career opportunities for our people.\n\nOur Services:\n✅ Virtual Bench – Pre-vetted cloud & software engineers, ready to deploy.\n✅ Project Team Deployment – Agile squads for high-impact initiatives.\n✅ Full Outcome-Based Delivery – Managed teams aligned to client objectives.\n\nFor more information contact: \ninfo@coltech.io\nUK| (+44) 20 3307 6850\nEurope| (+31) 202 414 844\nUSA | (+1) 512 717 7490\nhttps://www.coltech.io",
    "companyEmployeesCount": 35
  },
  {
    "id": "4288947379",
    "trackingId": "7/B77CAZ/2RstlSnLVn4vg==",
    "refId": "hoEvzJQzntQjIlxBn+RgFw==",
    "link": "https://www.linkedin.com/jobs/view/staff-backend-software-engineer-java-at-clear-4288947379?refId=hoEvzJQzntQjIlxBn%2BRgFw%3D%3D&trackingId=7%2FB77CAZ%2F2RstlSnLVn4vg%3D%3D&position=24&pageNum=0",
    "title": "Staff Backend Software Engineer (Java)",
    "companyName": "CLEAR",
    "companyLinkedinUrl": "https://www.linkedin.com/company/clear-by-alclear-llc?trk=public_jobs_jserp-result_job-search-card-subtitle",
    "companyLogo": "https://media.licdn.com/dms/image/v2/C4D0BAQFrwD0HNYHBEA/company-logo_100_100/company-logo_100_100/0/1630537854608/clear_by_alclear_llc_logo?e=1772064000&v=beta&t=_6Yx6_GHH3PCyPA-XimVOv57T19cq5x8W3Rh7RkzCKM",
    "location": "New York, NY",
    "salaryInfo": [
      ""
    ],
    "postedAt": "2026-02-08",
    "benefits": [],
    "descriptionHtml": "<p><span>Have you ever had that green-light feeling? When you hit every green light and the day just feels like magic. CLEAR's mission is to create frictionless experiences where every day has that feeling. With more than 30+ million passionate members and hundreds of partners around the world, CLEAR’s identity platform is transforming the way people live, work, and travel. Whether it’s at the airport, stadium, or right on your phone, CLEAR connects you to the things that make you, you - unlocking easier, more secure, and more seamless experiences - making them all feel like magic.</span></p><p><span>We’re looking for an experienced Staff Software Engineer to help us build the next generation of products that will go beyond just ID and enable our members to leverage the power of a networked digital identity. As a Staff Software Engineer at CLEAR, you will participate in the design, implementation, testing, and deployment of applications to build and enhance our platform- one that interconnects dozens of attributes and qualifications while keeping member privacy and security at the core.&nbsp;&nbsp;</span></p><p><span><em><strong>A brief highlight of our tech stack:</strong></em></span></p><ul><li>Java / Javascript / React / Typescript / Python / Postgres&nbsp;</li><li>AWS cloud&nbsp;</li></ul><p>&nbsp;</p><p><em><strong>What you'll do:</strong></em></p><ul><li>Advance our capabilities across a wide array of industries and domains and gain hands-on experience with privacy, security, data modeling and architecture&nbsp;</li><li>Develop and deliver code across the full stack, driving engineering excellence by defining best practices in testing, documentation and observability</li><li>Partner with product and other stakeholders to uncover requirements, to innovate, and to solve complex problems</li><li>Have a strong sense of ownership, responsible for architectural decision-making and strive for continuous improvement in technology and processes at CLEAR</li></ul><p>&nbsp;</p><p><strong><em>What you’re great at:</em></strong></p><ul><li>9+ years of software development experience</li><li>Working with cloud-based application development, and being fluent in at least a few of:&nbsp;<ul><li>Cloud service providers like AWS</li><li>Containerization technologies like Docker and Kubernetes</li><li>Collaboration, integration, and deployment tools like GitHub and Argo</li></ul></li><li>Articulating technical concepts to a mixed audience of technical and non-technical stakeholders</li><li>Collaborating and mentoring less experienced members of the team</li><li>Comfort with ambiguity&nbsp;</li><li>Curiosity about technology, believing in constant learning, and the ability to be autonomous to figure out what's important</li></ul><p>&nbsp;</p><p><span><em><strong>How You'll be Rewarded:</strong></em></span></p><p>At CLEAR, we help YOU move forward - because when you’re at your best, we’re at our best. You’ll work with talented team members motivated by our mission of making experiences safer and easier. Our offices are bright and energetic with an open concept and plenty of conference rooms and casual co-working spaces. We also offer catered lunches every day and have fully stocked kitchens. Outside of the office, we invest in your well-being and learning &amp; development with stipends and reimbursement programs.</p><p><span>We offer holistic total rewards, including comprehensive healthcare plans, family-building benefits (fertility and adoption/surrogacy support), flexible time off, annual wellness stipend, free OneMedical memberships for you and your dependents, a CLEAR Plus membership, and a 401(k) retirement plan with employer match. </span><span>The base salary range for this role is $215,000 - $250,000, depending on levels of skills and experience.</span></p><p><em><span>The base salary range represents the low and high end of CLEAR’s salary range for this position. Salaries will vary depending on various factors which include, but are not limited to location, education, skills, experience and performance. The range listed is just one component of CLEAR’s total compensation package for employees and other rewards may include annual bonuses, commission, Restricted Stock Units</span></em></p><p><span><em>CLEAR provides reasonable accommodation to qualified individuals with disabilities or protected needs. Please let us know if you require a reasonable accommodation to apply for a job or perform your job. Examples of reasonable accommodation include, but are not limited to, time off, extra breaks, making a change to the application process or work procedures, policy exceptions, providing documents in an alternative format, live captioning or using a sign language interpreter, or using specialized equipment.</em></span></p><p></p><span></span>",
    "applicantsCount": "200",
    "applyUrl": "https://grnh.se/6v3uqsg71us?source=LinkedIn",
    "salary": "",
    "descriptionText": "Have you ever had that green-light feeling? When you hit every green light and the day just feels like magic. CLEAR's mission is to create frictionless experiences where every day has that feeling. With more than 30+ million passionate members and hundreds of partners around the world, CLEAR’s identity platform is transforming the way people live, work, and travel. Whether it’s at the airport, stadium, or right on your phone, CLEAR connects you to the things that make you, you - unlocking easier, more secure, and more seamless experiences - making them all feel like magic.We’re looking for an experienced Staff Software Engineer to help us build the next generation of products that will go beyond just ID and enable our members to leverage the power of a networked digital identity. As a Staff Software Engineer at CLEAR, you will participate in the design, implementation, testing, and deployment of applications to build and enhance our platform- one that interconnects dozens of attributes and qualifications while keeping member privacy and security at the core.&nbsp;&nbsp;A brief highlight of our tech stack:Java / Javascript / React / Typescript / Python / Postgres&nbsp;AWS cloud&nbsp;&nbsp;What you'll do:Advance our capabilities across a wide array of industries and domains and gain hands-on experience with privacy, security, data modeling and architecture&nbsp;Develop and deliver code across the full stack, driving engineering excellence by defining best practices in testing, documentation and observabilityPartner with product and other stakeholders to uncover requirements, to innovate, and to solve complex problemsHave a strong sense of ownership, responsible for architectural decision-making and strive for continuous improvement in technology and processes at CLEAR&nbsp;What you’re great at:9+ years of software development experienceWorking with cloud-based application development, and being fluent in at least a few of:&nbsp;Cloud service providers like AWSContainerization technologies like Docker and KubernetesCollaboration, integration, and deployment tools like GitHub and ArgoArticulating technical concepts to a mixed audience of technical and non-technical stakeholdersCollaborating and mentoring less experienced members of the teamComfort with ambiguity&nbsp;Curiosity about technology, believing in constant learning, and the ability to be autonomous to figure out what's important&nbsp;How You'll be Rewarded:At CLEAR, we help YOU move forward - because when you’re at your best, we’re at our best. You’ll work with talented team members motivated by our mission of making experiences safer and easier. Our offices are bright and energetic with an open concept and plenty of conference rooms and casual co-working spaces. We also offer catered lunches every day and have fully stocked kitchens. Outside of the office, we invest in your well-being and learning &amp; development with stipends and reimbursement programs.We offer holistic total rewards, including comprehensive healthcare plans, family-building benefits (fertility and adoption/surrogacy support), flexible time off, annual wellness stipend, free OneMedical memberships for you and your dependents, a CLEAR Plus membership, and a 401(k) retirement plan with employer match. The base salary range for this role is $215,000 - $250,000, depending on levels of skills and experience.The base salary range represents the low and high end of CLEAR’s salary range for this position. Salaries will vary depending on various factors which include, but are not limited to location, education, skills, experience and performance. The range listed is just one component of CLEAR’s total compensation package for employees and other rewards may include annual bonuses, commission, Restricted Stock UnitsCLEAR provides reasonable accommodation to qualified individuals with disabilities or protected needs. Please let us know if you require a reasonable accommodation to apply for a job or perform your job. Examples of reasonable accommodation include, but are not limited to, time off, extra breaks, making a change to the application process or work procedures, policy exceptions, providing documents in an alternative format, live captioning or using a sign language interpreter, or using specialized equipment.",
    "seniorityLevel": "Director",
    "employmentType": "Full-time",
    "jobFunction": "Engineering and Information Technology",
    "industries": "Consumer Services",
    "inputUrl": "https://www.linkedin.com/jobs/search/?keywords=software developer &location=new york &f_TPR=r86400",
    "companyAddress": {
      "type": "PostalAddress",
      "streetAddress": "85 10th Ave",
      "addressLocality": "New York",
      "addressRegion": "NY",
      "postalCode": "10011",
      "addressCountry": "US"
    },
    "companyWebsite": "http://clearme.com",
    "companySlogan": "You are You.",
    "companyDescription": "CLEAR is a security identity company making experiences safer and easier—physically and digitally. With over 33 million Members and a growing network of partners across the world, CLEAR’s identity platform is transforming the way people live, work, and travel. Whether you are in the airport, at the stadium, or on your phone, CLEAR connects you to the things that make you, you. CLEAR+ helps you speed through airport security, while CLEAR1 is our enterprise product that powers trusted identity solutions for businesses across healthcare, travel, and financial services. Headquartered in New York City with offices in Austin, TX and Washington D.C., CLEAR’s mission is to strengthen security and create frictionless experiences.",
    "companyEmployeesCount": 2793
  },
  {
    "id": "4360114114",
    "trackingId": "fhqUqioz8zTax3bhzpJKqQ==",
    "refId": "hoEvzJQzntQjIlxBn+RgFw==",
    "link": "https://www.linkedin.com/jobs/view/senior-software-development-engineer-at-adobe-4360114114?refId=hoEvzJQzntQjIlxBn%2BRgFw%3D%3D&trackingId=fhqUqioz8zTax3bhzpJKqQ%3D%3D&position=25&pageNum=0",
    "title": "Senior Software Development Engineer",
    "companyName": "Adobe",
    "companyLinkedinUrl": "https://www.linkedin.com/company/adobe?trk=public_jobs_jserp-result_job-search-card-subtitle",
    "companyLogo": "https://media.licdn.com/dms/image/v2/D560BAQHilaKdJueUVg/company-logo_100_100/B56ZodIp56HUAU-/0/1761425400481?e=1772064000&v=beta&t=UTmULzf_oZI6EEv8VXGGw5cgGSTVD0nW-lkXP8umqm8",
    "location": "New York, NY",
    "salaryInfo": [
      ""
    ],
    "postedAt": "2026-02-08",
    "benefits": [
      "Actively Hiring"
    ],
    "descriptionHtml": "<strong>Our Company<br><br></strong>Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.<br><br>We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!<br><br>Our Company<br><br>Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.<br><br>We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!<br><br>THE OPPORTUNITY<br><br>Engineering at Frame.io, an Adobe Company, is about more than just writing code - it's crafting products that inspire creativity and allow our users to do great work. We care deeply about how our products are built, how they look, how they feel, and how they function. We are looking for a senior backend engineer who can turn ideas into beautifully written code that other people—or you, six months into the future—will find easy to comprehend and modify.<br><br>You will:<br><br><ul><li> Model a rich and expansive domain. You’ll design and implement data models for every facet of the post-production domain, as well as powerful systems to keep the Frame.io application efficient and stable. </li><li> Contribute to a mature Elixir application. Frame.io is home to one of the largest Elixir applications in the world, and senior engineers here have the opportunity to design highly concurrent, fault-tolerant systems. </li><li> Own the implementation of amazing features. You’ll work directly with designers, client engineers, and product owners to bring new features to life. You’ll provide guidance and input into the process of building and deploying their vision, as well as writing the code that makes it real. </li><li> Guide and mentor your fellow engineers. You’ll be an authority on practices for the engineering team, as well as an important leader for other engineers - backend and otherwise. Our team is highly productive and committed to mutual support, collaboration, and knowledge-sharing. We are dedicated to a work environment where we can all grow and learn, and combine this commitment with a dedication to quality engineering and sound, informed technical decisions. We understand that the best code moves our business forward, and we make every decision about the backend in the context of the product that everybody is building together. <br><br></li></ul><strong>What You'll Do<br><br></strong><ul><li> Write solid and scalable code. </li><li> Doing regular code reviews. </li><li> Building new features and services in Elixir. </li><li> Providing technical leadership to junior engineers. <br><br></li></ul><strong>What You Need To Succeed<br><br></strong><ul><li> Extensive experience in designing and developing multiple large-scale Web application backend systems. </li><li> Deep experience in overall system design and implementation—how they scale, how they should fit together, and how they’re likely to break. </li><li> Familiarity with common API and services design standards. </li><li> Experience in PostgreSQL or MySQL outside of an ORM, including the ability to design SQL queries for performance and efficiency. </li><li> Experience in modifying and migrating legacy components with little to no downtime. </li><li> Ability to analyze and solve difficult problems across the backend. </li><li> Experience in Elixir or a comparable functional programming language, or interest and a deep desire to learn. <br><br></li></ul>If you are an avid learner, an excellent human, and passionate about functional programming - we want to hear from you!<br><br>Our compensation reflects the cost of labor across several  U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $139,000 -- $257,550 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.<br><br>In New York, the pay range for this position is $177,900 - $257,550<br><br>At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).<br><br>In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.<br><br>State-Specific Notices:<br><br>California:<br><br>Fair Chance Ordinances<br><br>Adobe will consider qualified applicants with arrest or conviction records for employment in accordance with state and local laws and “fair chance” ordinances.<br><br>Colorado:<br><br>Application Window Notice<br><br>Apr 01 2026 12:00 AM<br><br>If this role is open to hiring in Colorado (as listed on the job posting), the application window will remain open until at least the date and time stated above in Pacific Time, in compliance with Colorado pay transparency regulations. If this role does not have Colorado listed as a hiring location, no specific application window applies, and the posting may close at any time based on hiring needs.<br><br>Massachusetts:<br><br>Massachusetts Legal Notice<br><br>It is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.<br><br>Adobe is proud to be an Equal Employment Opportunity employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.<br><br>Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.<br><br>Our compensation reflects the cost of labor across several  U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $139,000 -- $257,550 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.<br><br>In New York, the pay range for this position is $177,900 - $257,550<br><br>At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).<br><br>In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.<br><br><strong>State-Specific Notices:<br><br></strong><strong>California:<br><br></strong><strong>Fair Chance Ordinances<br><br></strong>Adobe will consider qualified applicants with arrest or conviction records for employment in accordance with state and local laws and “fair chance” ordinances.<br><br><strong>Colorado:<br><br></strong><strong>Application Window Notice<br><br></strong>If this role is open to hiring in Colorado (as listed on the job posting), the application window will remain open until at least the date and time stated above in Pacific Time, in compliance with Colorado pay transparency regulations. If this role does not have Colorado listed as a hiring location, no specific application window applies, and the posting may close at any time based on hiring needs.<br><br><strong>Massachusetts:<br><br></strong><strong>Massachusetts Legal Notice<br><br></strong>It is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.<br><br>Adobe is proud to be an Equal Employment Opportunity employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.<br><br>Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.",
    "applicantsCount": "146",
    "applyUrl": "https://careers.adobe.com/us/en/job/ADOBUSR164099EXTERNALENUS/Senior-Software-Development-Engineer?utm_source=linkedin&utm_medium=phenom-feeds&source=LinkedIn",
    "salary": "",
    "descriptionText": "Our CompanyChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!Our CompanyChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!THE OPPORTUNITYEngineering at Frame.io, an Adobe Company, is about more than just writing code - it's crafting products that inspire creativity and allow our users to do great work. We care deeply about how our products are built, how they look, how they feel, and how they function. We are looking for a senior backend engineer who can turn ideas into beautifully written code that other people—or you, six months into the future—will find easy to comprehend and modify.You will: Model a rich and expansive domain. You’ll design and implement data models for every facet of the post-production domain, as well as powerful systems to keep the Frame.io application efficient and stable.  Contribute to a mature Elixir application. Frame.io is home to one of the largest Elixir applications in the world, and senior engineers here have the opportunity to design highly concurrent, fault-tolerant systems.  Own the implementation of amazing features. You’ll work directly with designers, client engineers, and product owners to bring new features to life. You’ll provide guidance and input into the process of building and deploying their vision, as well as writing the code that makes it real.  Guide and mentor your fellow engineers. You’ll be an authority on practices for the engineering team, as well as an important leader for other engineers - backend and otherwise. Our team is highly productive and committed to mutual support, collaboration, and knowledge-sharing. We are dedicated to a work environment where we can all grow and learn, and combine this commitment with a dedication to quality engineering and sound, informed technical decisions. We understand that the best code moves our business forward, and we make every decision about the backend in the context of the product that everybody is building together. What You'll Do Write solid and scalable code.  Doing regular code reviews.  Building new features and services in Elixir.  Providing technical leadership to junior engineers. What You Need To Succeed Extensive experience in designing and developing multiple large-scale Web application backend systems.  Deep experience in overall system design and implementation—how they scale, how they should fit together, and how they’re likely to break.  Familiarity with common API and services design standards.  Experience in PostgreSQL or MySQL outside of an ORM, including the ability to design SQL queries for performance and efficiency.  Experience in modifying and migrating legacy components with little to no downtime.  Ability to analyze and solve difficult problems across the backend.  Experience in Elixir or a comparable functional programming language, or interest and a deep desire to learn. If you are an avid learner, an excellent human, and passionate about functional programming - we want to hear from you!Our compensation reflects the cost of labor across several  U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $139,000 -- $257,550 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.In New York, the pay range for this position is $177,900 - $257,550At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.State-Specific Notices:California:Fair Chance OrdinancesAdobe will consider qualified applicants with arrest or conviction records for employment in accordance with state and local laws and “fair chance” ordinances.Colorado:Application Window NoticeApr 01 2026 12:00 AMIf this role is open to hiring in Colorado (as listed on the job posting), the application window will remain open until at least the date and time stated above in Pacific Time, in compliance with Colorado pay transparency regulations. If this role does not have Colorado listed as a hiring location, no specific application window applies, and the posting may close at any time based on hiring needs.Massachusetts:Massachusetts Legal NoticeIt is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.Adobe is proud to be an Equal Employment Opportunity employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.Our compensation reflects the cost of labor across several  U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $139,000 -- $257,550 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.In New York, the pay range for this position is $177,900 - $257,550At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.State-Specific Notices:California:Fair Chance OrdinancesAdobe will consider qualified applicants with arrest or conviction records for employment in accordance with state and local laws and “fair chance” ordinances.Colorado:Application Window NoticeIf this role is open to hiring in Colorado (as listed on the job posting), the application window will remain open until at least the date and time stated above in Pacific Time, in compliance with Colorado pay transparency regulations. If this role does not have Colorado listed as a hiring location, no specific application window applies, and the posting may close at any time based on hiring needs.Massachusetts:Massachusetts Legal NoticeIt is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.Adobe is proud to be an Equal Employment Opportunity employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.",
    "seniorityLevel": "Mid-Senior level",
    "employmentType": "Full-time",
    "jobFunction": "Engineering and Information Technology",
    "industries": "Advertising Services, IT Services and IT Consulting, and Software Development",
    "inputUrl": "https://www.linkedin.com/jobs/search/?keywords=software developer &location=new york &f_TPR=r86400",
    "companyAddress": {
      "type": "PostalAddress",
      "streetAddress": "345 Park Avenue",
      "addressLocality": "San Jose",
      "addressRegion": "CA",
      "postalCode": "95110-2704",
      "addressCountry": "US"
    },
    "companyWebsite": "http://www.adobe.com",
    "companySlogan": "Changing the world through digital experiences.",
    "companyDescription": "Adobe is the global leader in digital media and digital marketing solutions. Our creative, marketing and document solutions empower everyone – from emerging artists to global brands – to bring digital creations to life and deliver immersive, compelling experiences to the right person at the right moment for the best results. In short, Adobe is everywhere, and we’re changing the world through digital experiences.",
    "companyEmployeesCount": 41813
  }
]